user_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "address", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Souvick Mondal"], ["address", "Udaynarayanpur,Howrah-711226"], ["age", 22], ["created_at", "2022-04-12 06:39:29.727767"], ["updated_at", "2022-04-12 06:39:29.727767"]]

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "email" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-04-17 16:20:52.302883"], ["email", "abc@gmail.com"], ["id", 2]]

  def get_user_details
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]