app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."id" DESC
---
  def index
    @quotes = Quote.ordered

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def show
    @quote = Quote.find(params[:id])

INSERT INTO "quotes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hey"], ["created_at", "2022-04-27 12:11:23.180421"], ["updated_at", "2022-04-27 12:11:23.180421"]]
---
  def create
    @quote = Quote.new(quote_params)

    if @quote.save

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @quote = Quote.find(params[:id])

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "quotes" SET "name" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["name", "His"], ["updated_at", "2022-04-28 10:36:30.781523"], ["id", 44]]
---
  def update
    @quote = Quote.find(params[:id])

    if @quote.update(quote_params)

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 29]]
---
  def destroy
    @quote = Quote.find(params[:id])
    @quote.destroy